---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.OnMaterial(Autodesk.Revit.DB.MaterialNode)
source: html/9d2dc6b3-21a7-5362-2bf5-2cb11b42c2d4.htm
---
# Autodesk.Revit.DB.IExportContext.OnMaterial Method

This method marks a change of the material.

## Syntax (C#)
```csharp
void OnMaterial(
	MaterialNode node
)
```

## Parameters
- **node** (`Autodesk.Revit.DB.MaterialNode`) - A node describing the current material.